api/app/controllers/blogs_controller.rb

  def index
    blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def find_blog
    Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]